xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/01.controller_unit.old/system/libs/fwlib/py32l090_hal_dma_ex.h
/**
  ******************************************************************************
  * @file    py32l090_hal_dma_ex.h
  * @author  MCU Application Team
  * @brief   Header file of DMA HAL extension module.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 Puya Semiconductor Co.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by Puya under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __PY32L090_HAL_DMA_EX_H
#define __PY32L090_HAL_DMA_EX_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "py32l090_hal_def.h"

/** @addtogroup PY32L090_HAL_Driver
  * @{
  */

/** @defgroup DMAEx DMAEx
  * @{
  */

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/* Exported macro ------------------------------------------------------------*/
/** @defgroup DMAEx_Exported_Macros DMA Extended Exported Macros
  * @{
  */

/**
  * @brief  Returns the current DMA Channel transfer complete flag.
  * @param  __HANDLE__: DMA handle
  * @retval The specified transfer complete flag index.
  */
#define __HAL_DMA_GET_TC_FLAG_INDEX(__HANDLE__) \
(((uint32_t)((__HANDLE__)->Instance) == ((uint32_t)DMA_Channel1))? DMA_FLAG_TC1 :\
 ((uint32_t)((__HANDLE__)->Instance) == ((uint32_t)DMA_Channel2))? DMA_FLAG_TC2 :\
 ((uint32_t)((__HANDLE__)->Instance) == ((uint32_t)DMA_Channel3))? DMA_FLAG_TC3 :\
 ((uint32_t)((__HANDLE__)->Instance) == ((uint32_t)DMA_Channel4))? DMA_FLAG_TC4 :\
 ((uint32_t)((__HANDLE__)->Instance) == ((uint32_t)DMA_Channel5))? DMA_FLAG_TC5 :\
 ((uint32_t)((__HANDLE__)->Instance) == ((uint32_t)DMA_Channel6))? DMA_FLAG_TC6 :\
 DMA_FLAG_TC7)

/**
  * @brief  Returns the current DMA Channel block transfer complete flag.
  * @param  __HANDLE__: DMA handle
  * @retval The specified transfer complete flag index.
  */
#define __HAL_DMA_GET_BTC_FLAG_INDEX(__HANDLE__) \
(((uint32_t)((__HANDLE__)->Instance) == ((uint32_t)DMA_Channel1))? DMA_FLAG_BTC1 :\
 ((uint32_t)((__HANDLE__)->Instance) == ((uint32_t)DMA_Channel2))? DMA_FLAG_BTC2 :\
 ((uint32_t)((__HANDLE__)->Instance) == ((uint32_t)DMA_Channel3))? DMA_FLAG_BTC3 :\
 ((uint32_t)((__HANDLE__)->Instance) == ((uint32_t)DMA_Channel4))? DMA_FLAG_BTC4 :\
 ((uint32_t)((__HANDLE__)->Instance) == ((uint32_t)DMA_Channel5))? DMA_FLAG_BTC5 :\
 ((uint32_t)((__HANDLE__)->Instance) == ((uint32_t)DMA_Channel6))? DMA_FLAG_BTC6 :\
 DMA_FLAG_BTC7)

/**
  * @brief  Returns the current DMA Channel half block transfer complete flag.
  * @param  __HANDLE__: DMA handle
  * @retval The specified transfer complete flag index.
  */
#define __HAL_DMA_GET_HBT_FLAG_INDEX(__HANDLE__) \
(((uint32_t)((__HANDLE__)->Instance) == ((uint32_t)DMA_Channel1))? DMA_FLAG_HBT1 :\
 ((uint32_t)((__HANDLE__)->Instance) == ((uint32_t)DMA_Channel2))? DMA_FLAG_HBT2 :\
 ((uint32_t)((__HANDLE__)->Instance) == ((uint32_t)DMA_Channel3))? DMA_FLAG_HBT3 :\
 ((uint32_t)((__HANDLE__)->Instance) == ((uint32_t)DMA_Channel4))? DMA_FLAG_HBT4 :\
 ((uint32_t)((__HANDLE__)->Instance) == ((uint32_t)DMA_Channel5))? DMA_FLAG_HBT5 :\
 ((uint32_t)((__HANDLE__)->Instance) == ((uint32_t)DMA_Channel6))? DMA_FLAG_HBT6 :\
 DMA_FLAG_HBT7)

/**
  * @brief  Return the current DMA Channel transfer error flag.
  * @param  __HANDLE__: DMA handle
  * @retval The specified transfer error flag index.
  */
#define __HAL_DMA_GET_TE_FLAG_INDEX(__HANDLE__)\
(((uint32_t)((__HANDLE__)->Instance) == ((uint32_t)DMA_Channel1))? DMA_FLAG_TE1 :\
 ((uint32_t)((__HANDLE__)->Instance) == ((uint32_t)DMA_Channel2))? DMA_FLAG_TE2 :\
 ((uint32_t)((__HANDLE__)->Instance) == ((uint32_t)DMA_Channel3))? DMA_FLAG_TE3 :\
 ((uint32_t)((__HANDLE__)->Instance) == ((uint32_t)DMA_Channel4))? DMA_FLAG_TE4 :\
 ((uint32_t)((__HANDLE__)->Instance) == ((uint32_t)DMA_Channel5))? DMA_FLAG_TE5 :\
 ((uint32_t)((__HANDLE__)->Instance) == ((uint32_t)DMA_Channel6))? DMA_FLAG_TE6 :\
 DMA_FLAG_TE7)

/**
  * @brief  Get the DMA Channel pending flags.
  * @param  __HANDLE__: DMA handle
  * @param  __FLAG__: Get the specified flag.
  *          This parameter can be any combination of the following values:
  *            @arg DMA_FLAG_TCx:   Transfer complete flag
  *            @arg DMA_FLAG_BTCx:  block Transfer complete flag
  *            @arg DMA_FLAG_HBTx:  half block Transfer complete flag
  *            @arg DMA_FLAG_TEx:  Transfer error flag
  *         Where x can be 1_7 to select the DMA Channel flag.
  * @retval The state of FLAG (SET or RESET).
  */

#define __HAL_DMA_GET_FLAG(__HANDLE__, __FLAG__)   (DMA->ISR & (__FLAG__))

/**
  * @brief  Clear the DMA Channel pending flags.
  * @param  __HANDLE__: DMA handle
  * @param  __FLAG__: specifies the flag to clear.
  *          This parameter can be any combination of the following values:
  *            @arg DMA_FLAG_TCx:   Transfer complete flag
  *            @arg DMA_FLAG_BTCx:  block Transfer complete flag
  *            @arg DMA_FLAG_HBTx:  half block Transfer complete flag
  *            @arg DMA_FLAG_TEx:  Transfer error flag
  *         Where x can be 1_7 to select the DMA Channel flag.
  * @retval None
  */
#define __HAL_DMA_CLEAR_FLAG(__HANDLE__, __FLAG__) (DMA->IFCR = (__FLAG__))


/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif

/************************ (C) COPYRIGHT Puya *****END OF FILE****/
